app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "This Is My Test"], ["description", "Testing testing Testing Testing "], ["created_at", "2021-02-07 17:13:33.245309"], ["updated_at", "2021-02-07 17:13:33.245309"], ["author_id", 7]]
---
  def create
    @post = Post.new(post_params)
    @post.save